### 1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [45]:
import pandas as pd

data = pd.Series([4, 8, 15, 16, 23, 42])
print(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [46]:
type(data)

pandas.core.series.Series

<br>
<br>

### 2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [47]:
num = [1,2,3,4,5,6,7,8,9,10]
pd.Series(num)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

<br>
<br>

### 3. Create a Pandas DataFrame that contains the following data:

| Name | Age | Gender |
|------|-----|--------|
|Alice|25|Female|
|Bob|30|Male|
|Claire|27|Female|

In [48]:
data = { 'Name':["Alice","Bob","Claire"],
         'Age':[25,30,27],
         'Gender':["Female","Male","Female"]
       }

df = pd.DataFrame(data)

In [49]:
print(df.loc[0])

Name       Alice
Age           25
Gender    Female
Name: 0, dtype: object

<br>
<br>

### 4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas, Tabular form of data is known as DataFrame and series is one-dimensional array almost similar as a list. We can say that dataframe is made up of one or multiple series either by rows or columns.

In the below you can see type of df variable is a dataframe , if i print it , it would be in tabular form and if i extract a column or row from it than it would be a series

In [50]:
type(df)

pandas.core.frame.DataFrame

In [51]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [52]:
# printing a row
df.loc[0]

Name       Alice
Age           25
Gender    Female
Name: 0, dtype: object

In [53]:
# type of row extracted
type(df.loc[0])

pandas.core.series.Series

In [54]:
# printing a column
df['Name']

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [55]:
# type of column extracted
type(df['Name'])

pandas.core.series.Series

<br>
<br>

### 5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

1. Drop :-: If you want to drop a column from a dataframe than we can use drop().

In [56]:
# Dropping the age column
df.drop("Age",axis=1)

     Name  Gender
0   Alice  Female
1     Bob    Male
2  Claire  Female

2. assign :-: If you want to add a column in a dataframe than we can use assign().

In [57]:
# Adding a new column Occupation
occupation = ["Engineer","Lawyer","Doctor"]
df.assign(Occupation = occupation)

     Name  Age  Gender Occupation
0   Alice   25  Female   Engineer
1     Bob   30    Male     Lawyer
2  Claire   27  Female     Doctor

3. merge :-: If you want to join two dataframes into a single dataframe according to columns than we can use merge()

In [58]:
# As we are merging by age and we only had one common age in between two dataframe which is 25
pd.merge(df,df2,on="Age")

  Name_x  Age  Gender Name_y      Occupation
0  Alice   25  Female  Kittu  Java Developer

4. sort_values :-: If you want to sort the rows of a dataframe depending on a columns than we can use sort_values()

In [60]:
# We are sorting all the rows by the Age column
df.sort_values("Age")

     Name  Age  Gender
0   Alice   25  Female
2  Claire   27  Female
1     Bob   30    Male

5. apply() :-: If you want to apply a function along an axis or column than we can use apply()

In [65]:
def capitalize(a):
    return a.upper()

df["Name"].apply(capitalize)

0     ALICE
1       BOB
2    CLAIRE
Name: Name, dtype: object

<br>
<br>

### 6. Which of the following is mutable in nature Series, DataFrame, Panel?

All pandas data-structure are value-mutable but size-immutable objects. That means you can't change the size of the data-structure but you can change the value. That goes for Series, DataFrame and Panel as well.

<br>
<br>

### 7. Create a DataFrame using multiple Series. Explain with an example.

In [42]:
col_names = pd.Series(["Name","Age","Occupation"])
names = pd.Series(["Lakshika",23,"ML Engineer"])
age = pd.Series(["Kittu",25,"Java Developer"])
occupation = pd.Series(["Mansi",23,"Defence Officer"])
df2 = pd.DataFrame(data=[names.values,age.values,occupation.values],columns=col_names)

In [43]:
df2

       Name  Age       Occupation
0  Lakshika   23      ML Engineer
1     Kittu   25   Java Developer
2     Mansi   23  Defence Officer